---
kind: method
id: M:Autodesk.Revit.DB.AreaVolumeSettings.GetAreaVolumeSettings(Autodesk.Revit.DB.Document)
source: html/597305b5-7971-ea95-5f29-97c55a793456.htm
---
# Autodesk.Revit.DB.AreaVolumeSettings.GetAreaVolumeSettings Method

Get the area and volume settings of the project.

## Syntax (C#)
```csharp
public static AreaVolumeSettings GetAreaVolumeSettings(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The area and volume settings of the project.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null